import Accordion from 'react-bootstrap/Accordion';
import "../Css/Questions.css"


function AccorDion({ contentKey }) {

   
    const accordionContent = {
        button1: [
          { title: "هل يستخدم الموقع لديكم خاصية لزيادة الأمان على الشبكة؟", content: "نعم، نحن نطبق معايير أمنية مشددة لحماية سرية وسلامة بياناتكم الشخصية عند نقلها أو تخزينها أو معالجتها. ومن إحدى هذه معايير الأمنية هى تقنية بروتوكول نقل النص التشعبى الآمن أو ما يدعى HTTPS." },
          { title: "ما هى سياسة الخصوصية للموقع", content: "تستطيع أن تعرف سياسة الخصوصية من خلال هذا الرابط" },
        ],
        button2: [
          { title: 'هل يجب تواجدي في الجهة الحكومية لطلب الخدمة؟   ', content: 'إذا كانت الخدمة المطلوبة تتطلب توقيعك أو وجودك الشخصى فيجب عليك التوجه للجهة الحكومية التابع لها الخدمة لإتمام طلبك، مثل خدمة إصدار توكيل، يجب على المواطن الحضور للتأكد من الأهلية والتحقق من الشخصيات. يمكنك معرفة إذا كانت الخدمة تتطلب وجودك أم لا، من خلال الضغط على "الشروط والأحكام" قبل البدء في طلب الخدمة.' },
          { title: 'ما هي المستندات المطلوبة عادةً؟', content: 'الاستغناء عن المستندات الورقية هو هدفنا في بوابة مصر الرقمية ولكن بعض الخدمات قد تحتاج إلى مستندات ورقية لاستكمالها. يمكنك معرفة إذا كانت الخدمة تتطلب مستندات ورقية أم لا، من خلال الضغط على "الشروط والأحكام" قبل البدء في طلب الخدمة.' },
        ],
        button3: [
          { title: 'هل تُقدَم خدمات SmartGov مجاناً؟', content: 'إنشاء حساب على SmartGov مجانى، وكذلك بعض الخدمات الأخرى. يمكنك معرفة رسوم أى خدمة غير مجانية عن طريق الضغط على “الشروط والأحكام” الموجودة فى بداية كل خدمة، علماً بأن الرسوم قد تختلف من خدمة إلى أخرى.' },
          { title: 'هل أحتاج إلى تسجيل الدخول للوصول إلى الخدمات المقدمة على هذا الموقع؟', content: 'لاستخدام الموقع والاستمتاع بخدماته المختلفة تحتاج لتسجيل الدخول أو إنشاء حساب.' },
        ],
        button4: [
          { title: 'ما هو نظام الادارة الذكية للخدمات الحكومية   ', content: 'SmartGov  تتكون من موقع وتطبيق هاتفى لتسهيل الوصول للخدمات الحكومية على المواطنين المصريين.' },
          { title: 'هل تصميم الموقع يعمل مع كل الأجهزة؟', content: 'تم تصميم هذا الموقع ليتناسب مع أحجام الشاشات المختلفة مثل الهواتف الذكية والأجهزة اللوحية وأجهزة الكمبيوتر المكتبية وأجهزة التلفاز وجميع أنواع المتصفحات.' },
        ],
        button5: [
          { title: 'ما هى طريقة الوصول للخدمات؟', content: 'يمكنك البحث عن الخدمة المطلوبة باستخدام خاصية البحث الموجودة دائمًا على اليسار أعلى الموقع.يوجد خدمات مقترحة فى الصفحة الرئيسية يتم اقتراحها عليك بناءً على استخدامك للموقع.إن لم تجد الخدمة المطلوبة عن طريق الطرق السابقة، استخدم دليل الخدمات وتصفّح حسب الفئة.' },
          { title: 'كم يُستغرق من الوقت لاستكمال الخدمات؟', content: 'قد تختلف الخدمة عن غيرها ولكن يتم توضيح الوقت فى خلال نهاية الخطوات لكل خدمة.يوجد خدمة مجانية لإرسال الرسائل النصية أو الإشعارات من خلال التطبيق عند استكمال الطلب.' },
          {title : 'هل يوجد على الموقع خاصية بحث؟', content :'نعم، خاصية البحث موجودة في القائمة في الجزء الأعلى على اليسار من كل صفحة.'},
          {title : 'ما هى اللغات المتوفرة على البوابة؟', content :'تقدم هذه البوابة الخدمات باللغتين العربية والإنجليزية، ولكن اللغة العربية هى المتاحة فقط الآن.'}
        ],
   
      };



    const contentToShow = accordionContent[contentKey] || [];
  return (
    <>
    <Accordion defaultActiveKey="0" alwaysOpen className='custom-accordion'>
          {contentToShow.map((item, index) => (
            <Accordion.Item key={index} eventKey={index.toString()}>
              <Accordion.Header>{item.title}</Accordion.Header>
              <Accordion.Body>{item.content}</Accordion.Body>
           </Accordion.Item>
         ))}
       </Accordion>
    </>

  )
}

export default AccorDion



